app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @post = Post.all.order(created_at: :desc)

INSERT INTO "posts" ("content", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?)  [["content", "わわわわわ"], ["created_at", "2021-08-21 22:30:27.589969"], ["updated_at", "2021-08-21 22:30:27.589969"], ["user", "じゅごんさん"]]
---
  def create
    @post = Post.new(content:params[:content],user:params[:user])
    @post.save