app/controllers/users_controller.rb

    def register
        @user = User.new(name: params[:name],character: params[:character])
        @user.save
---
INSERT INTO "users" ("name", "character", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a"], ["character", "(SO)"], ["created_at", "2021-08-26 21:49:58.311098"], ["updated_at", "2021-08-26 21:49:58.311098"]]